<?php

	/**
	 * システムコールクラス
	 * 
	 * @author ----
	 * @version 1.0.0
	 * 
	 */
	class asp_typeSystem extends System
	{
		/**********************************************************************************************************
		 * 汎用システム用メソッド
		 **********************************************************************************************************/



		/////////////////////////////////////////////////////////////////////////////////////////////////////////
		// 登録関係
		/////////////////////////////////////////////////////////////////////////////////////////////////////////

		/**
		 * 削除内容確認。
		 *
		 * @param gm GUIManagerオブジェクト配列　連想配列で gm[ TABLE名 ] でアクセスが可能です。
		 * @param rec フォームのからの入力データを反映したレコードデータ。
		 * @return エラーがあるかを真偽値で渡す。
		 */
		function deleteCheck(&$gm, &$rec, $loginUserType, $loginUserRank ){
			// ** conf.php で定義した定数の中で、利用したい定数をココに列挙する。 *******************
			global $TEMPLATE_CLASS_SYSTEM;
			// **************************************************************************************
			
			$db = $gm[ $_GET['type'] ]->getDB();
			$asp_id = $db->getData( $rec, 'id' );
			
			$adDB = $gm[ 'adwares' ]->getDB();
			
			$table = $adDB->searchTable( $adDB->getTable(), 'asp_type', '=', $asp_id );
			if( $adDB->getRow( $table ) ){
				
				System::$checkData->addError( 'not_adwares_zero' );
			}
			
			return parent::deleteCheck( $gm, $rec, $loginUserType, $loginUserRank );
		}

		/**********************************************************************************************************
		 * 汎用システム描画系用メソッド
		 **********************************************************************************************************/
	}

?>