<?php

	/**
	 * システムコールクラス
	 * 
	 * @author ----
	 * @version 1.0.0
	 * 
	 */
	class sendmailSystem extends System
	{
		/**********************************************************************************************************
		 * 汎用システム用メソッド
		 **********************************************************************************************************/

		/////////////////////////////////////////////////////////////////////////////////////////////////////////
		// 登録関係
		/////////////////////////////////////////////////////////////////////////////////////////////////////////

		/**
		 * 登録処理完了処理。
		 * 登録完了時にメールで内容を通知したい場合などに用います。
		 * 
		 * @param gm GUIManagerオブジェクト配列　連想配列で gm[ TABLE名 ] でアクセスが可能です。
		 * @param rec レコードデータ。
		 */
		function registComp( &$gm, &$rec, $loginUserType, $loginUserRank )
		{
			// ** conf.php で定義した定数の中で、利用したい定数をココに列挙する。 *******************
			global $MAILSEND_ADDRES;
			global $MAILSEND_NAMES;
			// **************************************************************************************

			$templateFile = Template::getLabelFile( 'SEND_MAIL' );
			Mail::send( $templateFile , $MAILSEND_ADDRES , $_POST[ 'mail' ] , $gm[ $_GET[ 'type' ] ] , $rec , $MAILSEND_NAMES );
			Mail::send( $templateFile , $MAILSEND_ADDRES , $MAILSEND_ADDRES , $gm[ $_GET[ 'type' ] ] , $rec , $MAILSEND_NAMES );

			parent::registComp( $gm, $rec, $loginUserType, $loginUserRank );			
		}

		/**********************************************************************************************************
		 * 汎用システム描画系用メソッド
		 **********************************************************************************************************/
	}

?>